---
type: ImageTypeOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ImageTypeOptions

`Autodesk.Revit.DB.ImageTypeOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ImageTypeOptions | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValid | 2020 | `public bool IsValid ( Document document )` |
| Method | SetExternalResourceReference | 2020 | `public void SetExternalResourceReference ( ExternalResourceReference resourceReference )` |
| Method | SetPath | — | `` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PageNumber | 2020 | `public int PageNumber { get ; set ; }` |
| Property | Path | 2020 | `public string Path { get ; }` |
| Property | Resolution | 2020 | `public double Resolution { get ; set ; }` |
| Property | SourceType | 2021 | `public ImageTypeSource SourceType { get ; set ; }` |